IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_PBIST_TOP_PBIST.xml
<module name="TOP_PBIST_TOP_PBIST" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TOP_PBIST_PBIST_A0" acronym="TOP_PBIST_PBIST_A0" offset="0x100" width="16" description="">
		<bitfield id="PBIST_CI2" width="16" begin="15" end="0" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_A1" acronym="TOP_PBIST_PBIST_A1" offset="0x104" width="16" description="">
		<bitfield id="PBIST_CI3" width="16" begin="15" end="0" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_A2" acronym="TOP_PBIST_PBIST_A2" offset="0x108" width="32" description="">
		<bitfield id="RGS" width="8" begin="31" end="24" resetval="0x0" description="TI Internal Register.Reserved for HW RnD These registers do not have a default value after reset." range="31 - 24" rwaccess="RW"/> 
		<bitfield id="RDS" width="8" begin="23" end="16" resetval="0x0" description="TI Internal Register.Reserved for HW RnD These registers do not have a default value after reset." range="23 - 16" rwaccess="RW"/> 
		<bitfield id="DWR" width="8" begin="15" end="8" resetval="0x0" description="TI Internal Register.Reserved for HW RnD These registers do not have a default value after reset." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="RAM" width="8" begin="7" end="0" resetval="0x0" description="TI Internal Register.Reserved for HW RnD These registers do not have a default value after reset." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_A3" acronym="TOP_PBIST_PBIST_A3" offset="0x10C" width="16" description="">
		<bitfield id="DLR1" width="8" begin="15" end="8" resetval="0x2" description="Datalogger Register[8] : Reserevd[9] : Default Testing Mode. When in this mode, ROM-based testing is kicked off. If the intention is to perform go/no-go testing via config, write to both this bit and bit [2] ofthe Datalogger Register simultaneously[15:10] : Reserevd" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="DLR0" width="8" begin="7" end="0" resetval="0x8" description="Datalogger Register[1:0] : Reserved[2] : ROM-based testing mode. Setting this bit to 1 enables the PBIST controller to execute test algorithms that arestored in the PBIST ROM[3] : Do not change this bit from its default value of 1[4] : Config access mode. Setting this bit allows the host processor to configure the PBIST controller registers[7:5] : Reserved" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_L0" acronym="TOP_PBIST_PBIST_L0" offset="0x110" width="8" description="">
		<bitfield id="PBIST_CMS" width="4" begin="3" end="0" resetval="0x0" description="TI Internal Register.Reserved for HW RnD These registers do not have a default value after reset." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_L1" acronym="TOP_PBIST_PBIST_L1" offset="0x114" width="8" description="">
		<bitfield id="PBIST_PC" width="5" begin="4" end="0" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_L2" acronym="TOP_PBIST_PBIST_L2" offset="0x118" width="32" description="">
		<bitfield id="SCR3" width="8" begin="31" end="24" resetval="0x118" description="TI Internal Register.Reserved for HW RnD" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="SCR2" width="8" begin="23" end="16" resetval="0x84" description="TI Internal Register.Reserved for HW RnD" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="SCR1" width="8" begin="15" end="8" resetval="0x50" description="TI Internal Register.Reserved for HW RnD" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="SCR0" width="8" begin="7" end="0" resetval="0x16" description="TI Internal Register.Reserved for HW RnD" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_L3" acronym="TOP_PBIST_PBIST_L3" offset="0x11C" width="32" description="">
		<bitfield id="SCR7" width="8" begin="31" end="24" resetval="0x254" description="TI Internal Register.Reserved for HW RnD" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="SCR6" width="8" begin="23" end="16" resetval="0x220" description="TI Internal Register.Reserved for HW RnD" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="SCR5" width="8" begin="15" end="8" resetval="0x186" description="TI Internal Register.Reserved for HW RnD" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="SCR4" width="8" begin="7" end="0" resetval="0x152" description="TI Internal Register.Reserved for HW RnD" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_DD10" acronym="TOP_PBIST_PBIST_DD10" offset="0x120" width="32" description="">
		<bitfield id="CS3" width="8" begin="31" end="24" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="CS2" width="8" begin="23" end="16" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="CS1" width="8" begin="15" end="8" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="CS0" width="8" begin="7" end="0" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_DE10" acronym="TOP_PBIST_PBIST_DE10" offset="0x124" width="8" description="">
		<bitfield id="PBIST_FDLY" width="8" begin="7" end="0" resetval="0x72" description="TI Internal Register.Reserved for HW RnD" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_CA0" acronym="TOP_PBIST_PBIST_CA0" offset="0x130" width="0" description="">
		<bitfield id="PBIST_PACT" width="1" begin="0" end="0" resetval="0x0" description="Pbist Active/ROM Clock Enable Register[0]: This bit must be set to turn on internal PBIST clocks. Setting this bit asserts an internal signal that is usedas the clock gate enable. As long as this bit is 0, any access to PBIST will not go through, and PBIST willremain in an almost zero-power mode.Value 0  = Disable internal PBIST clocksValue 1 = Enable internal PBIST clocks" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_CA1" acronym="TOP_PBIST_PBIST_CA1" offset="0x134" width="8" description="">
		<bitfield id="PBIST_ID" width="5" begin="4" end="0" resetval="0x1" description="PBIST ID.This is a unique ID assigned to each PBIST controller in a device with multiple PBIST controllers. The value of this register does not affect the functionality of the CPU interface." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_CA2" acronym="TOP_PBIST_PBIST_CA2" offset="0x138" width="0" description="">
		<bitfield id="PBIST_FSFR0" width="1" begin="0" end="0" resetval="0x0" description="Fail Status Fail Register- Port 0 This register indicates if a failure occurred during a memory self-test.Value 0 = No failure occurredValue 1 = Indicates a failure" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_PBIST_PBIST_CA3" acronym="TOP_PBIST_PBIST_CA3" offset="0x13C" width="0" description="">
		<bitfield id="PBIST_FSFR1" width="1" begin="0" end="0" resetval="0x0" description="Fail Status Fail Register- Port 1 This register indicates if a failure occurred during a memory self-test.Value 0 = No failure occurredValue 1 = Indicates a failure" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_PBIST_PBIST_CL0" acronym="TOP_PBIST_PBIST_CL0" offset="0x140" width="8" description="">
		<bitfield id="PBIST_FSRCR0" width="4" begin="3" end="0" resetval="0x0" description="Fail Status Count - Port 0 These registers keep count of the number of failures observed during the memory self-test. The PBISTcontroller stops executing the memory self-test whenever a failure occurs in any memory instance for anyof the test algorithms. The value in gets incremented by one whenever a failure occurs" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_PBIST_PBIST_CL1" acronym="TOP_PBIST_PBIST_CL1" offset="0x144" width="8" description="">
		<bitfield id="PBIST_FSRCR1" width="4" begin="3" end="0" resetval="0x0" description="Fail Status Count - Port 1These registers keep count of the number of failures observed during the memory self-test. The PBISTcontroller stops executing the memory self-test whenever a failure occurs in any memory instance for anyof the test algorithms. The value in gets incremented by one whenever a failure occurs" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_PBIST_PBIST_CL2" acronym="TOP_PBIST_PBIST_CL2" offset="0x148" width="16" description="">
		<bitfield id="PBIST_FSRA1" width="16" begin="15" end="0" resetval="0x0" description="TI Internal Register.Reserved for HW RnD" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_PBIST_PBIST_CL3" acronym="TOP_PBIST_PBIST_CL3" offset="0x14C" width="32" description="">
		<bitfield id="PBIST_FSRDL0" width="32" begin="31" end="0" resetval="0x2863311530" description="TI Internal Register.Reserved for HW RnD" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_PBIST_PBIST_CI0" acronym="TOP_PBIST_PBIST_CI0" offset="0x150" width="32" description="">
		<bitfield id="PBIST_FSRDL1" width="32" begin="31" end="0" resetval="0x2863311530" description="TI Internal Register.Reserved for HW RnD" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_PBIST_PBIST_CI1" acronym="TOP_PBIST_PBIST_CI1" offset="0x154" width="8" description="">
		<bitfield id="PBIST_ROM" width="2" begin="1" end="0" resetval="0x3" description="Rom Mask .This two-bit register sets appropriate ROM access modes for the PBIST controller.Value  0h = No information is used from ROMValue 1h = Only RAM Group information from ROMVaule 2h = Only Algorithm information from ROMValue 3h = Both Algorithm and RAM information from ROM. This option should be selected for application self-test." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_CI2" acronym="TOP_PBIST_PBIST_CI2" offset="0x158" width="32" description="">
		<bitfield id="ALGO3" width="8" begin="31" end="24" resetval="0x255" description="This register is used to indicate the algorithm(s) to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="31 - 24" rwaccess="RW"/> 
		<bitfield id="ALGO2" width="8" begin="23" end="16" resetval="0x255" description="This register is used to indicate the algorithm(s) to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="23 - 16" rwaccess="RW"/> 
		<bitfield id="ALGO1" width="8" begin="15" end="8" resetval="0x255" description="This register is used to indicate the algorithm(s) to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="ALGO0" width="8" begin="7" end="0" resetval="0x255" description="This register is used to indicate the algorithm(s) to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_CI3" acronym="TOP_PBIST_PBIST_CI3" offset="0x15C" width="32" description="">
		<bitfield id="RINFOL3" width="8" begin="31" end="24" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="31 - 24" rwaccess="RW"/> 
		<bitfield id="RINFOL2" width="8" begin="23" end="16" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RINFOL1" width="8" begin="15" end="8" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="RINFOL0" width="8" begin="7" end="0" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_PBIST_PBIST_RAMT" acronym="TOP_PBIST_PBIST_RAMT" offset="0x160" width="32" description="">
		<bitfield id="RINFOU3" width="8" begin="31" end="24" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="31 - 24" rwaccess="RW"/> 
		<bitfield id="RINFOU2" width="8" begin="23" end="16" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RINFOU1" width="8" begin="15" end="8" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="RINFOU0" width="8" begin="7" end="0" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="7 - 0" rwaccess="RW"/>
	</register>
</module>